[
  {
    "title": "Amazon Link Cleaner",
    "description": "A simple and efficient tool for cleaning Amazon product links by removing tracking parameters and affiliate tags.",
    "tech": "Python, JavaScript, Docker, API"
  },
  {
    "title": "BananaSlug Emulator",
    "description": "A complete emulator for a custom RISC-style architecture, featuring a CPU, GPU, memory management, and ROM loading. It is written in C++17 and uses SDL2 for graphics output.",
    "tech": "C++, SDL2, RISC, CPU"
  },
  {
    "title": "Baseball Stats MCP Server",
    "description": "A Model Context Protocol server that provides access to baseball statistics and data through AI assistants.",
    "tech": "Python, API, AI"
  },
  {
    "title": "BingeFlix Backend",
    "description": "The backend service for BingeFlix, providing movie recommendations, user management, and streaming availability data.",
    "tech": "Node.js, Express, MongoDB"
  },
  {
    "title": "Dino Game on Basys3",
    "description": "A simplified version of the Chrome Dinosaur Game implemented on a Basys3 FPGA board with hardware modules for the dinosaur character, obstacles, and display drivers.",
    "tech": "FPGA, Verilog, SystemVerilog, Python"
  },
  {
    "title": "Distributed Task Queue System",
    "description": "A distributed task queue system with production-ready reliability patterns including retries, circuit breakers, and monitoring.",
    "tech": "Python, Docker, Redis, API"
  },
  {
    "title": "Easy Wireshark",
    "description": "An LLM-powered network traffic analyzer that uses Wireshark's tshark command-line tool to capture and analyze network traffic in a user-friendly way.",
    "tech": "Python, LLM, Wireshark"
  },
  {
    "title": "Image Classification Project",
    "description": "An image classification pipeline using PyTorch with custom dataset handling, ResNet-50 model training, and functionality for data preprocessing and prediction.",
    "tech": "Python, PyTorch, Machine Learning"
  },
  {
    "title": "Intermediate Representation Compiler",
    "description": "A compiler implementation with intermediate representation components for the CSE110A course, including parsing, optimization, and code generation.",
    "tech": "Python, Compiler, IR"
  },
  {
    "title": "OpenBiomechanics Baseball Injury Risk Assessment System",
    "description": "A machine learning system for assessing baseball injury risk through biomechanical analysis and predictive modeling.",
    "tech": "Python, Machine Learning, AI"
  },
  {
    "title": "Real-Time Drawing Board Backend",
    "description": "The backend for a collaborative real-time drawing platform built with Django and Django Channels, managing user interactions and WebSocket synchronization.",
    "tech": "Django, WebSockets, Python"
  },
  {
    "title": "Scholarly Research MCP Server",
    "description": "A consolidated research tool that helps find and analyze academic papers from PubMed, Google Scholar, ArXiv, and JSTOR through AI-powered search capabilities.",
    "tech": "TypeScript, Python, OpenAI, API"
  }
]